In [3]:
d=[1,2,3,4,5,6]
import pandas as pd
pd.Series(data=d)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [7]:
d=[1,2,3,4,5,6]
i=['a','b','c','d','e','f']
import pandas as pd
s1=pd.Series(data=d, index=i)
s1

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [9]:
import pandas
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [10]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [23]:
import numpy as np
d3=np.random.randint(5,size=(5,5))
df=pd.DataFrame(data=d3,index=['a','b','c','d','e'], columns=['ind','aus','can','uk','sri'])
df

   ind  aus  can  uk  sri
a    2    3    4   2    2
b    4    2    3   4    0
c    1    1    4   0    2
d    2    1    0   3    4
e    2    4    4   4    3

In [32]:
df.shape
df.size
df.columns
df.info()
df.describe()
df.head(2)
df.tail(2)

   ind  aus  can  uk  sri
d    2    1    0   3    4
e    2    4    4   4    3

In [33]:
df.head(2).describe()

            ind       aus       can        uk       sri
count  2.000000  2.000000  2.000000  2.000000  2.000000
mean   3.000000  2.500000  3.500000  3.000000  1.000000
std    1.414214  0.707107  0.707107  1.414214  1.414214
min    2.000000  2.000000  3.000000  2.000000  0.000000
25%    2.500000  2.250000  3.250000  2.500000  0.500000
50%    3.000000  2.500000  3.500000  3.000000  1.000000
75%    3.500000  2.750000  3.750000  3.500000  1.500000
max    4.000000  3.000000  4.000000  4.000000  2.000000

In [38]:
# Description with aggregate function
df.count()
df.sum(axis=1)
df.min()
df.max()
df.mean()
df.median()
df.idxmin()
df.idxmax()

ind    b
aus    e
can    a
uk     b
sri    d
dtype: object

In [39]:
df

   ind  aus  can  uk  sri
a    2    3    4   2    2
b    4    2    3   4    0
c    1    1    4   0    2
d    2    1    0   3    4
e    2    4    4   4    3

In [41]:
df.idxmin(axis=1)

a    ind
b    sri
c     uk
d    can
e    ind
dtype: object

In [16]:
from sklearn.datasets import load_breast_cancer
d=load_breast_cancer()
d

{'data': array([[1.799e+01, 1.038e+01, 1.228e+02, ..., 2.654e-01, 4.601e-01,
         1.189e-01],
        [2.057e+01, 1.777e+01, 1.329e+02, ..., 1.860e-01, 2.750e-01,
         8.902e-02],
        [1.969e+01, 2.125e+01, 1.300e+02, ..., 2.430e-01, 3.613e-01,
         8.758e-02],
        ...,
        [1.660e+01, 2.808e+01, 1.083e+02, ..., 1.418e-01, 2.218e-01,
         7.820e-02],
        [2.060e+01, 2.933e+01, 1.401e+02, ..., 2.650e-01, 4.087e-01,
         1.240e-01],
        [7.760e+00, 2.454e+01, 4.792e+01, ..., 0.000e+00, 2.871e-01,
         7.039e-02]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0,
        1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0,
        1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1,
        1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0,
        0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1,
        1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0,
        0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0,
        1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1,
        1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0,
        0, 1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0,
        0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0,
        1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1,
        1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1,
        1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0,
        1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1,
        1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 1,
        1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1]),
 'frame': None,
 'target_names': array(['malignant', 'benign'], dtype='<U9'),
 'DESCR': '.. _breast_cancer_dataset:\n\nBreast cancer wisconsin (diagnostic) dataset\n--------------------------------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 569\n\n    :Number of Attributes: 30 numeric, predictive attributes and the class\n\n    :Attribute Information:\n        - radius (mean of distances from center to points on the perimeter)\n        - texture (standard deviation of gray-scale values)\n        - perimeter\n        - area\n        - smoothness (local variation in radius lengths)\n        - compactness (perimeter^2 / area - 1.0)\n        - concavity (severity of concave portions of the contour)\n        - concave points (number of concave portions of the contour)\n        - symmetry\n        - fractal dimension ("coastline approximation" - 1)\n\n        The mean, standard error, and "worst" or largest (mean of the three\n        worst/largest values) of these features were computed for each image,\n        resulting in 30 features.  For instance, field 0 is Mean Radius, field\n        10 is Radius SE, field 20 is Worst Radius.\n\n        - class:\n                - WDBC-Malignant\n                - WDBC-Benign\n\n    :Summary Statistics:\n\n    ===================================== ====== ======\n                                           Min    Max\n    ===================================== ====== ======\n    radius (mean):                        6.981  28.11\n    texture (mean):                       9.71   39.28\n    perimeter (mean):                     43.79  188.5\n    area (mean):                          143.5  2501.0\n    smoothness (mean):                    0.053  0.163\n    compactness (mean):                   0.019  0.345\n    concavity (mean):                     0.0    0.427\n    concave points (mean):                0.0    0.201\n    symmetry (mean):                      0.106  0.304\n    fractal dimension (mean):             0.05   0.097\n    radius (standard error):              0.112  2.873\n    texture (standard error):             0.36   4.885\n    perimeter (standard error):           0.757  21.98\n    area (standard error):                6.802  542.2\n    smoothness (standard error):          0.002  0.031\n    compactness (standard error):         0.002  0.135\n    concavity (standard error):           0.0    0.396\n    concave points (standard error):      0.0    0.053\n    symmetry (standard error):            0.008  0.079\n    fractal dimension (standard error):   0.001  0.03\n    radius (worst):                       7.93   36.04\n    texture (worst):                      12.02  49.54\n    perimeter (worst):                    50.41  251.2\n    area (worst):                         185.2  4254.0\n    smoothness (worst):                   0.071  0.223\n    compactness (worst):                  0.027  1.058\n    concavity (worst):                    0.0    1.252\n    concave points (worst):               0.0    0.291\n    symmetry (worst):                     0.156  0.664\n    fractal dimension (worst):            0.055  0.208\n    ===================================== ====== ======\n\n    :Missing Attribute Values: None\n\n    :Class Distribution: 212 - Malignant, 357 - Benign\n\n    :Creator:  Dr. William H. Wolberg, W. Nick Street, Olvi L. Mangasarian\n\n    :Donor: Nick Street\n\n    :Date: November, 1995\n\nThis is a copy of UCI ML Breast Cancer Wisconsin (Diagnostic) datasets.\nhttps://goo.gl/U2Uwz2\n\nFeatures are computed from a digitized image of a fine needle\naspirate (FNA) of a breast mass.  They describe\ncharacteristics of the cell nuclei present in the image.\n\nSeparating plane described above was obtained using\nMultisurface Method-Tree (MSM-T) [K. P. Bennett, "Decision Tree\nConstruction Via Linear Programming." Proceedings of the 4th\nMidwest Artificial Intelligence and Cognitive Science Society,\npp. 97-101, 1992], a classification method which uses linear\nprogramming to construct a decision tree.  Relevant features\nwere selected using an exhaustive search in the space of 1-4\nfeatures and 1-3 separating planes.\n\nThe actual linear program used to obtain the separating plane\nin the 3-dimensional space is that described in:\n[K. P. Bennett and O. L. Mangasarian: "Robust Linear\nProgramming Discrimination of Two Linearly Inseparable Sets",\nOptimization Methods and Software 1, 1992, 23-34].\n\nThis database is also available through the UW CS ftp server:\n\nftp ftp.cs.wisc.edu\ncd math-prog/cpo-dataset/machine-learn/WDBC/\n\n.. topic:: References\n\n   - W.N. Street, W.H. Wolberg and O.L. Mangasarian. Nuclear feature extraction \n     for breast tumor diagnosis. IS&T/SPIE 1993 International Symposium on \n     Electronic Imaging: Science and Technology, volume 1905, pages 861-870,\n     San Jose, CA, 1993.\n   - O.L. Mangasarian, W.N. Street and W.H. Wolberg. Breast cancer diagnosis and \n     prognosis via linear programming. Operations Research, 43(4), pages 570-577, \n     July-August 1995.\n   - W.H. Wolberg, W.N. Street, and O.L. Mangasarian. Machine learning techniques\n     to diagnose breast cancer from fine-needle aspirates. Cancer Letters 77 (1994) \n     163-171.',
 'feature_names': array(['mean radius', 'mean texture', 'mean perimeter', 'mean area',
        'mean smoothness', 'mean compactness', 'mean concavity',
        'mean concave points', 'mean symmetry', 'mean fractal dimension',
        'radius error', 'texture error', 'perimeter error', 'area error',
        'smoothness error', 'compactness error', 'concavity error',
        'concave points error', 'symmetry error',
        'fractal dimension error', 'worst radius', 'worst texture',
        'worst perimeter', 'worst area', 'worst smoothness',
        'worst compactness', 'worst concavity', 'worst concave points',
        'worst symmetry', 'worst fractal dimension'], dtype='<U23'),
 'filename': 'C:\\Users\\user\\anaconda3\\lib\\site-packages\\sklearn\\datasets\\data\\breast_cancer.csv'}

In [18]:
pd.DataFrame(data=d['data'],columns=d['feature_names'])

,mean radius,mean texture,mean perimeter,mean area,mean smoothness,mean compactness,mean concavity,mean concave points,mean symmetry,mean fractal dimension,...,worst radius,worst texture,worst perimeter,worst area,worst smoothness,worst compactness,worst concavity,worst concave points,worst symmetry,worst fractal dimension
0,17.99,10.38,122.80,1001.0,0.11840,0.27760,0.30010,0.14710,0.2419,0.07871,...,25.380,17.33,184.60,2019.0,0.16220,0.66560,0.7119,0.2654,0.4601,0.11890
1,20.57,17.77,132.90,1326.0,0.08474,0.07864,0.08690,0.07017,0.1812,0.05667,...,24.990,23.41,158.80,1956.0,0.12380,0.18660,0.2416,0.1860,0.2750,0.08902
2,19.69,21.25,130.00,1203.0,0.10960,0.15990,0.19740,0.12790,0.2069,0.05999,...,23.570,25.53,152.50,1709.0,0.14440,0.42450,0.4504,0.2430,0.3613,0.08758
3,11.42,20.38,77.58,386.1,0.14250,0.28390,0.24140,0.10520,0.2597,0.09744,...,14.910,26.50,98.87,567.7,0.20980,0.86630,0.6869,0.2575,0.6638,0.17300
4,20.29,14.34,135.10,1297.0,0.10030,0.13280,0.19800,0.10430,0.1809,0.05883,...,22.540,16.67,152.20,1575.0,0.13740,0.20500,0.4000,0.1625,0.2364,0.07678
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
564,21.56,22.39,142.00,1479.0,0.11100,0.11590,0.24390,0.13890,0.1726,0.05623,...,25.450,26.40,166.10,2027.0,0.14100,0.21130,0.4107,0.2216,0.2060,0.07115
565,20.13,28.25,131.20,1261.0,0.09780,0.10340,0.14400,0.09791,0.1752,0.05533,...,23.690,38.25,155.00,1731.0,0.11660,0.19220,0.3215,0.1628,0.2572,0.06637
566,16.60,28.08,108.30,858.1,0.08455,0.10230,0.09251,0.05302,0.1590,0.05648,...,18.980,34.12,126.70,1124.0,0.11390,0.30940,0.3403,0.1418,0.2218,0.07820
567,20.60,29.33,140.10,1265.0,0.11780,0.27700,0.35140,0.15200,0.2397,0.07016,...,25.740,39.42,184.60,1821.0,0.16500,0.86810,0.9387,0.2650,0.4087,0.12400
568,7.76,24.54,47.92,181.0,0.05263,0.04362,0.00000,0.00000,0.1587,0.05884,...,9.456,30.37,59.16,268.6,0.08996,0.06444,0.0000,0.0000,0.2871,0.07039

In [42]:
df

   ind  aus  can  uk  sri
a    2    3    4   2    2
b    4    2    3   4    0
c    1    1    4   0    2
d    2    1    0   3    4
e    2    4    4   4    3

In [47]:
# Indexing and slicing 
df.iloc[:,1]
df.iloc[2]
df.iloc[:,[1]]
df.iloc[2:4,1:3]
df.iloc[2,1]

1

In [48]:
df.loc[['a','d'],['ind','can']]

   ind  can
a    2    4
d    2    0

In [49]:
df

   ind  aus  can  uk  sri
a    2    3    4   2    2
b    4    2    3   4    0
c    1    1    4   0    2
d    2    1    0   3    4
e    2    4    4   4    3

In [50]:
df.ind

a    2
b    4
c    1
d    2
e    2
Name: ind, dtype: int32

In [54]:
df[['ind','can']]

   ind  can
a    2    4
b    4    3
c    1    4
d    2    0
e    2    4

In [58]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)
print(df.loc[0])    
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40
2       390        45
calories    420
duration     50
Name: 0, dtype: int64
   calories  duration
0       420        50
1       380        40

In [2]:
import numpy as np
import pandas as pd
d3=np.random.randint(5,size=(5,5))
df=pd.DataFrame(data=d3,index=['a','b','c','d','e'], columns=['ind','aus','can','uk','sri'])
df

   ind  aus  can  uk  sri
a    1    3    3   2    1
b    1    4    1   3    1
c    2    2    1   4    0
d    3    0    4   3    3
e    3    0    2   0    3

In [25]:
df.sort_index(axis=1) # Sorting with the Name of the column

   aus  can  ind  sri  uk
a    3    3    1    1   2
b    4    1    1    1   3
c    2    1    2    0   4
d    0    4    3    3   3
e    0    2    3    3   0

In [26]:
df.sort_values(by="a",axis=1,ascending=True) # Sorting with value of the column or rows

   ind  sri  uk  aus  can
a    1    1   2    3    3
b    1    1   3    4    1
c    2    0   4    2    1
d    3    3   3    0    4
e    3    3   0    0    2

In [33]:
df2=df.drop('ind',axis=1) # To delete column
df2=df.drop(index=['a']) # To delete row
df2

   ind  aus  can  uk  sri
b    1    4    1   3    1
c    2    2    1   4    0
d    3    0    4   3    3
e    3    0    2   0    3

In [38]:
df = pd.read_excel('F:\python\Salary.xlsx') # To imports data from excel
print(df.to_string())

e  229148  Senior Secondary          18        Married             Transportion    Male              40   42132.450000
186   58  Self Employed  154537           Masters          29        Married        Executive Manager  Female              20   63874.107500
187   50        Private  181901            Others          28        Married                   Others    Male              20  459450.000000
188   18        Private  152004  Senior Secondary           0      Unmarried                   Others    Male              20    5833.340000
189   27        Private  205188      High School            6        Married         Machine Operator    Male              40    9120.830000
190   24        Private   66634         Bachelors           2        Married      Frontend Developer     Male              16   32331.200000
191   38  Self Employed  180220            Others           9        Married                Craftsmen    Male              60   65000.000000
192   40  Self Employed   99651            Others          12        Married                Professor    Male              60   71435.200000
193   41        Private  327723           Masters           9       Divorced        Executive Manager    Male              40  215621.000000
194   32        Private  127384           Masters           7        Married  Machine Learning Expert    Male              55   55000.000000
195   30        Private  363296            Others           6      Unmarried      Frontend Developer     Male              72   40036.430000
196   28        Private   30070         Bachelors           4        Married                    Sales    Male              50   32102.750000
197   31     Government  595000         Bachelors           3        Married                   Others  Female              35   51000.000000
198   21        Private  152328            Others           0      Unmarried      Frontend Developer     Male              20   17999.990000
199   33     Government  177824           Masters           4       Divorced                   Others  Female              40  117217.240000
200   44     Government  111483           Masters          14        Married                Professor    Male              40  257396.060000
201   22        Private  199555         Bachelors           1      Unmarried     Full Stack Developer    Male              25   22466.625000
202   42        Private   50018            Others          14        Married                   Others    Male              40   43337.820000
203   36        Private  218490         Bachelors          12        Married                Craftsmen    Male              35   72447.270000
204   31        Private  159187           Masters           9       Divorced             Transportion    Male              40   40064.760000
205   21        Private   83033            Others           0      Unmarried                   Others  Female              25   13125.000000
206   34  Self Employed   24961           Masters           9        Married        Backend Developer    Male              80   66250.010000
207   21        Private  182117            Others           0      Unmarried        Backend Developer    Male              15   23444.000000
208   55  Self Employed  146576         Bachelors          15        Widowed                   Others    Male              48   72746.500000
209   29        Private  176690           Masters           5        Married     Full Stack Developer    Male              24   74166.670000
210   26        Private  122651            Others           4        Married                    Sales    Male              15   35000.010000
211   54  Self Employed  149650         Bachelors           9       Divorced                   Others    Male              40   74291.670000
212   34        Private  454508         Doctorate          11        Married                Professor    Male              65  171082.990000
213   41        Private  266530            Others           9        Married                   Others    Male              45   36249.990000
214   23        Private  198542         Bachelors           1      Unmarried      FrontEnd Developer   Female              40   27872.750000
215   24        Private  217961           Masters           0      Unmarried         Machine Operator    Male              40   34514.260000
216   21        Private  221661            Others           1      Unmarried                    Clerk  Female              40   10573.420000
217   44     Government   60735         Bachelors          13       Divorced                   Others  Female              60  122615.350000
218   47  Self Employed  121124         Bachelors          13        Married                    Sales    Male              40   61443.510000
219   31        Private   48588            Others          10        Married                Craftsmen    Male              40   49635.000000
220   53  Self Employed  240138         Bachelors           9        Married                Craftsmen    Male              60   50842.500000
221   44        Private  104196           Masters          14        Married     Full Stack Developer    Male              45  151500.010000
222   37        Private  230035         Doctorate           9        Married                   Others    Male              46  122250.000000
223   28        Private   38918            Others           7        Married                Craftsmen    Male              50   38811.250000
224   25     Government  205011           Masters           0      Unmarried      Frontend Developer     Male              10   71000.010000
225   25  Self Employed   77053         Bachelors           3        Married                  Others   Female              40   25000.000000
226   28        Private  132870         Bachelors           4        Married        Executive Manager  Female              18   42000.000000
227   26        Private  186061           Masters           3      Unmarried                  Others   Female              40   27000.000000
228   32        Private  140359         Bachelors           7       Divorced         Machine Operator  Female              40   22000.000000
229   37        Private  264663           Masters          10       Divorced                Professor  Female              40   90000.000000
230   34        Private  216864         Bachelors           9       Divorced                  Others   Female              45   78000.000000
231   28        Private  150601         Bachelors           6      Separated           Administration    Male              40   33000.000000
232   45     Government   88638         Doctorate          14      Unmarried                Professor  Female              20  190000.000000
233   35     Government  422013         Bachelors           9       Divorced                Professor  Female              40  112200.000000
234   29        Private   70037           Masters          10      Unmarried                Craftsman    Male              60   11220.000000
235   45        Private  172274         Doctorate          16       Divorced                Professor  Female              35  110662.660000
236   38  Self Employed  164526         Professor          15  Never-married                Professor    Male              45  108447.100000
237   52        Private  129177         Bachelors          13        Widowed                  Others   Female              20  103019.000000
238   32        Private  136204           Masters          14      Separated        Executive Manager    Male              55  100980.010000
239   46  Self Employed  172175         Doctorate          16      Unmarried                  Others     Male              40   35044.000000
240   46        Private   45363           Masters          15       Divorced       Frontend Developer    Male              40   45614.000000
241   45        Private  172822         Bachelors          14       Divorced           Transportation    Male              76   27541.500000
242   57        Private  317847           Masters          14       Divorced        Executive Manager    Male              50   96900.000000
243   22        Private  119592         Bachelors           1      Unmarried        Backend Developer    Male              40   25285.590000
244   34        Private  203034         Bachelors          13        Married                    Sales    Male              50   43430.460000
245   37        Private  188774         Bachelors          13        Married        Executive Manager    Male              40   93916.970000
246   29        Private   77009       High School           7      Unmarried                    Sales  Female              42   23000.000000
247   32        Private   29059         Bachelors           9       Divorced                    Sales  Female              25   33699.260000
248   51        Private  153870           Masters          10        Married     Full Stack Developer    Male              40   90879.980000
249   56     Government  135285           Masters           9        Married                Professor    Male              32   89236.800000
250   21        Private   34310    Administration           1      Unmarried     Full Stack Developer    Male              40   39236.800000
251   33        Private  228696         Bachelors           8        Married        Backend Developer    Male              32   36236.800000
252   49        Private  122066       High School          10        Married                  Others     Male              40   29236.800000
253   37  Self Employed  107164  Senior Secondary           6       Divorced           Transportation    Male              50   32236.800000
254   38        Private  175360         Bachelors          11      Unmarried                Professor    Male              90   86733.710000
255   23        Private   44064           Masters          10      Separated     Full Stack Developer    Male              40   36700.020000
256   59     Government  107287         Bachelors          18        Widowed           Administration  Female              50   86700.020000
257   52        Private  198863         Doctorate          15       Divorced                Professor    Male              60   86541.040000
258   45        Private  123011         Bachelors          13       Divorced        Executive Manager    Male              50   86351.160000
259   51     Government  205246         Bachelors          15        Married           Administration    Male              50   86084.380000
260   43     Government   39181         Doctorate          16       Divorced                Professor  Female              60   76067.150000
261   31        Private  149650           Masters           9        Married                    Sales    Male              48   45886.860000
262   51     Government  197163         Bachelors          15       Divorced        Executive Manager  Female              50   84150.000000
263   37  Self Employed  137527           Masters          16        Married       Frontend Developer  Female              60   44100.890000
264   48        Private  161691           Masters          14       Divorced  Machine Learning Expert  Female              40   84015.900000
265   44        Private  326232         Bachelors          13       Divorced           Administration    Male              50   83606.810000
266   43        Private  115806           Masters          14       Divorced        Backend Developer  Female              40   53196.980000
267   32        Private  115066  Senior Secondary          10       Divorced                    Clerk  Female              40   33183.690000
268   43        Private  289669           Masters          14       Divorced  Machine Learning Expert  Female              40   80113.560000
269   34        Private  100820         Bachelors           9        Married  Machine Learning Expert    Male              15   68795.000000
270   48        Private  121253         Bachelors          13        Married                    Sales  Female              70    5506.440000
271   27        Private  110380         Bachelors           9        Married                    Sales    Male              52   28294.110000
272   45  Self Employed  233882           Masters           9        Married        Backend Developer    Male              40   48020.360000
273   68        Private  192052         Doctorate          10        Widowed                Professor  Female              40   77578.320000
274   57     Government  174995           Masters          10        Married           Administration    Male              40   77518.960000
275   40  Self Employed  335549           Masters          11      Unmarried  Machine Learning Expert    Male              45   76961.330000
276   50        Private  237729  Senior Secondary           9        Widowed                  Others   Female              72   46504.000000
277   51     Government   68898         Bachelors          11       Divorced        Technical Support    Male              39   75678.910000
278   42        Private  107276           Masters          10        Married        Executive Manager  Female              40   54889.170000
279   39        Private  141584           Masters          14        Married                    Sales    Male              45   44828.830000
280   32        Private  207668         Bachelors          13      Unmarried        Backend Developer    Male              50   44769.200000
281   39        Private  313243           Masters          10        Married                Craftsman    Male              45   34496.720000
282   40     Government  147372         Bachelors          10        Married                    Clerk    Male              40   42606.330000
283   38        Private  237608         Bachelors          13        Widowed                    Sales  Female              45   42430.840000
284   33        Private  194901  Senior Secondary          11       Divorced                  Others     Male              42   31708.520000
285   43        Private  155106  Senior Secondary          12       Divorced                Craftsman    Male              70   32666.250000
286   25  Self Employed  121441         Bachelors           3      Unmarried     Full Stack Developer    Male              40   33634.890000
287   44        Private  162028         Bachelors          10        Married                    Clerk  Female               6   29616.270000
288   22        Private  160724         Bachelors           1      Unmarried                    Sales    Male              40   25409.580000
289   41        Private  132222           Masters          15        Married                Professor    Male              40   51400.010000
290   34  Self Employed  226355         Bachelors          11        Married        Backend Developer    Male              70   41400.010000
291   37        Private  329980           Masters          14       Divorced                Professor    Male              60   71400.010000
292   25  Self Employed  124137         Bachelors           2        Married       Frontend Developer    Male              35   30396.580000
293   39  Self Employed  329980         Bachelors          13        Married                    Sales    Male              60   40146.480000
294   42        Private  187702           Masters          10        Married                Professor    Male              60   69959.680000
295   21        Private  199029         Bachelors           0      Unmarried                    Sales    Male              55   21794.540000
296   28  Self Employed  145290         Bachelors           4        Married        Executive Manager    Male              50   39709.560000
297   41     Government  297248         Doctorate          10        Married                Professor    Male              45   69643.410000
298   23        Private  227856         Bachelors           1      Unmarried     Full Stack Developer    Male              50   33000.000000
299   49        Private  179731           Masters          14        Married           Administration  Female              65   69375.550000
300   42        Private  154374         Bachelors          13        Married        Executive Manager    Male              60   69359.990000
301   41        Private   27187           Masters          11        Married  Machine Learning Expert    Male              12   59155.240000
302   46        Private  326857           Masters          14        Married                    Sales    Male              65   39097.540000
303   40        Private  160369           Masters          14        Married        Executive Manager    Male              45   38799.020000
304   32        Private  396745         Bachelors          13      Unmarried       Frontend Developer    Male              48   38559.480000
305   41        Private  151089           Masters          10        Married         Machine Operator    Male              55   38059.100000
306   24        Private  336188         Bachelors           1      Unmarried        Backend Developer    Male              80   33000.000000
307   31        Private  279015           Masters           7      Unmarried        Backend Developer    Male              70   37388.110000
308   27        Private   43221         Bachelors           4        Married                  Others     Male              40   27228.200000
309   37  Self Employed   30529           Masters          13        Married  Machine Learning Expert    Male              50   46995.800000
310   44        Private  201742         Bachelors          13        Married        Executive Manager    Male              50   46681.430000
311   39  Self Employed  218490         Bachelors          15        Married                Professor    Male              50   50448.690000
312   43     Government  156996         Bachelors          15        Married                    Clerk    Male              55   46406.480000
313   21        Private  298449         Bachelors           0      Unmarried        Executive Manager    Male              50   36318.800000
314   44  Self Employed  191712           Masters          14        Married  Machine Learning Expert    Male              55   66317.720000
315   39        Private  198654  Senior Secondary          15        Married                Craftsman    Male              67   46300.000000
316   46  Self Employed  102308         Bachelors          13        Married                    Sales    Male              40   45114.630000
317   39        Private  348521         Bachelors          10        Married                  Others     Male              99   45976.370000
318   26        Private   56248         Bachelors           3        Married        Backend Developer    Male              60   35920.800000
319   31        Private  252752       High School           9        Married                  Others   Female              40   25901.300000
320   46        Private  192963         Bachelors          13        Married           Administration    Male              35   65858.420000
321   46  Self Employed  198759           Masters          15        Married                Professor    Male              80   45751.400000
322   39        Private  143123           Masters          11        Married  Machine Learning Expert    Male              40   65418.140000
323   39        Private  237713         Bachelors          15        Married                    Sales    Male              99   64803.900000
324   59        Private   81929         Doctorate          16        Widowed                Professor    Male              45   64739.220000
325   50  Self Employed  167793           Masters          15        Married  Machine Learning Expert    Male              60   62120.000000
326   46        Private  456062         Doctorate          16        Married                Professor    Male              55   71000.000000

In [45]:
df.drop(range(50,90))

,Age,Workclass,Fnlwgt,Education,Experience,Marital Status,Occupation,Sex,Hours per Week,Salary
0,23,Private,205865,Bachelors,1,Unmarried,Executive Manager,Male,28,31577.01
1,33,Self Employed,155781,High School,10,Married,Craftsman,Male,60,34000.00
2,54,Self Employed,406468,Bachelors,13,Married,Sales,Male,40,37890.69
3,48,Private,144397,Bachelors,10,Divorced,Technical Support,Female,30,25541.66
4,35,Self Employed,372525,Bachelors,12,Unarried,Executive Manager,Male,40,28454.01
...,...,...,...,...,...,...,...,...,...,...
322,39,Private,143123,Masters,11,Married,Machine Learning Expert,Male,40,65418.14
323,39,Private,237713,Bachelors,15,Married,Sales,Male,99,64803.90
324,59,Private,81929,Doctorate,16,Widowed,Professor,Male,45,64739.22
325,50,Self Employed,167793,Masters,15,Married,Machine Learning Expert,Male,60,62120.00
326,46,Private,456062,Doctorate,16,Married,Professor,Male,55,71000.00

In [46]:
def args(x):
    return x+10
df.Age.apply(args)

0      33
1      43
2      64
3      58
4      45
       ..
322    49
323    49
324    69
325    60
326    56
Name: Age, Length: 327, dtype: int64

In [47]:
df.head()

,Age,Workclass,Fnlwgt,Education,Experience,Marital Status,Occupation,Sex,Hours per Week,Salary
0,23,Private,205865,Bachelors,1,Unmarried,Executive Manager,Male,28,31577.01
1,33,Self Employed,155781,High School,10,Married,Craftsman,Male,60,34000.00
2,54,Self Employed,406468,Bachelors,13,Married,Sales,Male,40,37890.69
3,48,Private,144397,Bachelors,10,Divorced,Technical Support,Female,30,25541.66
4,35,Self Employed,372525,Bachelors,12,Unarried,Executive Manager,Male,40,28454.01

In [48]:
df.Education.nunique()

10

In [49]:
df.Education.unique() # To show head counts of one unique coloumn

array(['Bachelors', 'High School', 'Others', 'Masters', 'Doctorate',
       'Senior Secondary', 'Bachelors ', 'High School ', 'Professor',
       'Administration'], dtype=object)

In [52]:
df.Education.replace(['High School ', 'Bachelors '],['High School','Bachelors'],inplace=True) # Replacing the duplicates with error
df.Education.unique()

array(['Bachelors', 'High School', 'Others', 'Masters', 'Doctorate',
       'Senior Secondary', 'Professor', 'Administration'], dtype=object)

In [53]:
df.Education.value_counts() #To head count the headers

Bachelors           140
Masters              91
Others               40
Doctorate            20
Senior Secondary     19
High School          15
Administration        1
Professor             1
Name: Education, dtype: int64